--Module 6/7  20%

----ПОДСКАЗКА - погуглите их, чтобы найти решение
    -- JOIN
    -- WHERE

-----------------------------------------------------------------------------------------------------------

ВАША ЗАДАЧА: 

Напишите решение, чтобы найти сотрудников, которые зарабатывают больше, чем их руководители.

Верните таблицу результатов в любом порядке.

-----------------------------------------------------------------------------------------------------------
Table: Employee

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | name        | varchar |
    | salary      | int     |
    | managerId   | int     |
    +-------------+---------+

id - это primary key (столбец с уникальными значениями) для этой таблицы.
В каждой строке этой таблицы указан идентификатор сотрудника, его имя, зарплата и ID руководителя.

-----------------------------------------------------------------------------------------------------------
Input: 

Employee table:
    +----+-------+--------+-----------+
    | id | name  | salary | managerId |
    +----+-------+--------+-----------+
    | 1  | Joe   | 70000  | 3         |
    | 2  | Henry | 80000  | 4         |
    | 3  | Sam   | 60000  | Null      |
    | 4  | Max   | 90000  | Null      |
    +----+-------+--------+-----------+
Output: 
    +----------+
    | Employee |
    +----------+
    | Joe      |
    +----------+


-----------------------------------------------------------------------------------------------------------


