--Module 4/7 20%

----ПОДСКАЗКА - погуглите их, чтобы найти решение 
 --   Group BY
 --   Having Count()
 --   Distinct

 -----------------------------------------------------------------------------------------------------------

ВАША ЗАДАЧА: 

Напишите решение для отображения id клиентов из таблицы клиентов, которые купили все продукты в таблице продуктов.

Верните таблицу результатов в любом порядке.

-----------------------------------------------------------------------------------------------------------

Table: Customer
    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | customer_id | int     |
    | product_key | int     |
    +-------------+---------+

Эта таблица может содержать повторяющиеся строки. 
customer_id не равен нулю.
product_key - это foreign key(внешний ключ) таблицы Product.
 

Table: Product
    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | product_key | int     |
    +-------------+---------+
product_key - это primary key (столбец с уникальными значениями) для этой таблицы.
 

-----------------------------------------------------------------------------------------------------------
Формат результата приведен в следующем примере.


Example 1:

Input: 
Customer table:
    +-------------+-------------+
    | customer_id | product_key |
    +-------------+-------------+
    | 1           | 5           |
    | 2           | 6           |
    | 3           | 5           |
    | 3           | 6           |
    | 1           | 6           |
    +-------------+-------------+

Product table:
    +-------------+
    | product_key |
    +-------------+
    | 5           |
    | 6           |
    +-------------+


Output: 
    +-------------+
    | customer_id |
    +-------------+
    | 1           |
    | 3           |
    +-------------+

Объяснение: 
Клиенты, купившие все продукты (5 и 6), являются клиентами с идентификаторами 1 и 3.




-----------------------------------------------------------------------------------------------------------
-